Terraform plan in __terraform__
<details>
  <summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_oauth2callback_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2callback_function" {
      ~ available_memory_mb   = 256 -> 128
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2callback"
        name                  = "oauth2callback"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#471ea0244d9966cb1466d8bb851a3ae3"
        # (13 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2init"
        name                  = "oauth2init"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#471ea0244d9966cb1466d8bb851a3ae3"
        # (14 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.slack_publisher_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "slack_publisher_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/slack-publisher"
        name                  = "slack-publisher"
      ~ source_archive_object = "slack_publisher.zip" -> "slack_publisher.zip#4fbd529289d366c584be6729c6d80e09"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.gmail_notifier_archive_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive_bucket_object" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "+zcUtg==" -> (known after apply)
      ~ detect_md5hash = "a71FVoNtI0kCzDYqBJFG+A==" -> "different hash" # forces replacement
      ~ id             = "******************************************************************************" -> (known after apply)
      ~ md5hash        = "a71FVoNtI0kCzDYqBJFG+A==" -> (known after apply)
      ~ name           = "gmail_notifier.zip#6bbd4556836d234902cc362a049146f8" -> "gmail_notifier.zip#471ea0244d9966cb1466d8bb851a3ae3" # forces replacement
      ~ output_name    = "gmail_notifier.zip#6bbd4556836d234902cc362a049146f8" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%236bbd4556836d234902cc362a049146f8" -> (known after apply)
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

Plan generated in [Create terraform plan #35](https://github.com/Zenika/lilaobot/actions/runs/1233876673)